<template>
  <div>
    <div id="carouselExampleCaptions" class="carousel slide">
      <div class="carousel-indicators">
        <button
          type="button"
          data-bs-target="#carouselExampleCaptions"
          data-bs-slide-to="0"
          class="active"
          aria-current="true"
          aria-label="Slide 1"
        ></button>
        <button
          type="button"
          data-bs-target="#carouselExampleCaptions"
          data-bs-slide-to="1"
          aria-label="Slide 2"
        ></button>
        <button
          type="button"
          data-bs-target="#carouselExampleCaptions"
          data-bs-slide-to="2"
          aria-label="Slide 3"
        ></button>
      </div>
      <div class="carousel-inner">
        <div class="carousel-item active">
          <img src="../assets/TCAS66_BannerWeb.jpg" class="d-block w-100" alt="..." />
          <div class="carousel-caption d-none d-md-block">
            <h5></h5>
            <p></p>
          </div>
        </div>
        <div class="carousel-item">
          <img src="../assets/y4.jpg" class="d-block w-100" alt="..." />
          <div class="carousel-caption d-none d-md-block">
            <h5></h5>
            <p></p>
          </div>
        </div>
        <div class="carousel-item">
          <img
            src="../assets/banner_25650921092718_766833.png"
            class="d-block w-100"
            alt="..."
          />
          <div class="carousel-caption d-none d-md-block">
            <h5>Third slide label</h5>
            <p></p>
          </div>
        </div>
      </div>
      <button
        class="carousel-control-prev"
        type="button"
        data-bs-target="#carouselExampleCaptions"
        data-bs-slide="prev"
      >
        <span class="carousel-control-prev-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Previous</span>
      </button>
      <button
        class="carousel-control-next"
        type="button"
        data-bs-target="#carouselExampleCaptions"
        data-bs-slide="next"
      >
        <span class="carousel-control-next-icon" aria-hidden="true"></span>
        <span class="visually-hidden">Next</span>
      </button>
    </div>
    <br />
    <br />
    <div>
      <div class="row row-cols-1 row-cols-md-3 g-4">
        <div class="col">
          <div class="card h-100">
            <img
              src="../assets/321565424_1216039472628289_5605083823712239138_n.jpg"
              class="card-img-top"
              alt="..."
            />
            <div class="card-body">
              <h5 class="card-title">Com Camp!</h5>
              <p class="card-text">
                ข่าวดี🥰 น้องๆ ม.ปลาย และน้อง ปวช.
                ที่สนใจเข้าร่วมค่ายยุวชนคอมพิวเตอร์ครั้งที่ 21 (คอมแคมป์) Comcamp 21st
                CSMJU #CC21stCSMJU 🖥 ในวันที่ 2-4 กุมภาพันธ์ 2566 🕹ณ
                สาขาวิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
                จัดโดยพี่ๆวิทย์คอม แม่โจ้ ดูรายละเอียดค่ายได้ที่เว็บ :
                https://sites.google.com/view/comcamp21st สอบถามรายละเอียดเพิ่มเติมได้ที่
                Fanpage: Comcamp โทร : 093-038-8668 พี่ไอซ์ , 063-412-4036 พี่เเพร เครดิต
                ออกแบบโลโก้และโปสเตอร์โดยพี่ CSMJU Studio
                น้องที่ผ่านการอบรมจะได้รับพิจารณาพิเศษในการเข้าศึกษาต่อสาขาวิชาวิทยาการคอมพิวเตอร์
                ม.แม่โจ้
              </p>
            </div>
          </div>
        </div>
        <div class="col">
          <div class="card h-100">
            <img
              src="../assets/328312812_743438084019809_6562159309467139853_n.jpg"
              class="card-img-top"
              alt="..."
            />
            <div class="card-body">
              <h5 class="card-title">Lamphun Warriors</h5>
              <p class="card-text">
                #LPWRupdate 🐮🏆 . OFFICIAL : ผลการจับสลาก Revo Cup 2022/23
                รอบก่อนรองชนะเลิศ รอบ 8 ทีมสุดท้าย สโมสรลำพูนวอริเออร์ จะพบกับ พีที
                ประจวบเอฟซี โดยจะแข่งขันในวันพุธที่ 22 กุมภาพันธ์ 2566 นี้.
                #ลำพูนวอริเออร์
              </p>
            </div>
          </div>
        </div>
        <div class="col">
          <div class="card h-100">
            <img src="../assets/33.jpg" class="card-img-top" alt="..." />
            <div class="card-body">
              <h5 class="card-title">เลือกตั้งนายกองค์การนักศึกษา มหาวิทยาลัยแม่โจ้</h5>
              <p class="card-text">
                🧒👦👩👩‍🦳ขอเชิญรับฟังการประชันนโยบายและปราศัยหาเสียง
                ของผู้สมัครรับเลือกตั้งนายกองค์การนักศึกษา มหาวิทยาลัยแม่โจ้ ประจำปี 2566
                ในวันพุธที่ 1 กุมภาพันธ์ 2566 เวลา 18.00 น. เป็นต้นไป ณ เวทีดิน
                ข้างโรงอาหารเทอดกสิกร มหาิวทยาลัยแม่โจ้ 
                - ชมการแสดงวงดนตรี Maejo Banjo Man
                - การปราศัยหาเสียงของผู้สมัครนายก อนม. 
                -การแนะนำตัวผู้สมัครนายกสโมสรนักศึกษาคณะ/วิทยาลัย 
                -การแนะนำผู้สมครสมาชิกสภานักศึกษา 
                รับชั่วโมงกิจกรรม 3 ชั่วโมง อย่าลืม
                เลือกตั้งผู้นำองค์กรนักศึกษา มหาวิทยาลัยแม่โจ้ ประจำปี 2566 
                ในวันที่ 8 กุมภาพันธ์ 2566 ตั้งแต่วเลา 08.00 - 18.00 น.
                ทางระบบเลือกตั้งผู้นำองค์กรนักศึกษาออนไลน์ www.evote.mju.ac.th
                เลือกตั้งเป็นหน้าที่ เรียนรู้วิถึประชาธิปไตย
                #เลือกตั้งผู้นำนักศึกษาแม่โจ้66 ดูน้อยลง
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script></script>
